# DataFrames

Consider DataFrame as a combination of Series objects put together to share the same index.

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(1)

In [3]:
df1 = pd.DataFrame(randn(4,5),index=["R1", "R2", "R3","R4"],columns=["C1","C2","C3","C4","C5"])

In [4]:
df1

          C1        C2        C3        C4        C5
R1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
R2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
R3  1.462108 -2.060141 -0.322417 -0.384054  1.133769
R4 -1.099891 -0.172428 -0.877858  0.042214  0.582815

### Selection and Indexing

In [5]:
df1['C2']

R1   -0.611756
R2    1.744812
R3   -2.060141
R4   -0.172428
Name: C2, dtype: float64

In [6]:
# Pass a list of column names
df1[['C2','C4','C5']]

          C2        C4        C5
R1 -0.611756 -1.072969  0.865408
R2  1.744812  0.319039 -0.249370
R3 -2.060141 -0.384054  1.133769
R4 -0.172428  0.042214  0.582815

In [7]:
# Similar to SQL Syntax (NOT RECOMMENDED!)
df1.C1

R1    1.624345
R2   -2.301539
R3    1.462108
R4   -1.099891
Name: C1, dtype: float64

DataFrame Columns are just like Series.

In [8]:
type(df1['C2'])

pandas.core.series.Series

**Creating a new column:**

In [9]:
df1['C6'] = df1['C1'] + df1['C2']

In [10]:
df1

          C1        C2        C3        C4        C5        C6
R1  1.624345 -0.611756 -0.528172 -1.072969  0.865408  1.012589
R2 -2.301539  1.744812 -0.761207  0.319039 -0.249370 -0.556727
R3  1.462108 -2.060141 -0.322417 -0.384054  1.133769 -0.598033
R4 -1.099891 -0.172428 -0.877858  0.042214  0.582815 -1.272319

**Removing Columns**

In [11]:
df2=df1.drop('R4',axis=0)
df2

          C1        C2        C3        C4        C5        C6
R1  1.624345 -0.611756 -0.528172 -1.072969  0.865408  1.012589
R2 -2.301539  1.744812 -0.761207  0.319039 -0.249370 -0.556727
R3  1.462108 -2.060141 -0.322417 -0.384054  1.133769 -0.598033

In [12]:
df1

          C1        C2        C3        C4        C5        C6
R1  1.624345 -0.611756 -0.528172 -1.072969  0.865408  1.012589
R2 -2.301539  1.744812 -0.761207  0.319039 -0.249370 -0.556727
R3  1.462108 -2.060141 -0.322417 -0.384054  1.133769 -0.598033
R4 -1.099891 -0.172428 -0.877858  0.042214  0.582815 -1.272319

In [13]:
df1 #Not inplace(permanent change) unless specified!

          C1        C2        C3        C4        C5        C6
R1  1.624345 -0.611756 -0.528172 -1.072969  0.865408  1.012589
R2 -2.301539  1.744812 -0.761207  0.319039 -0.249370 -0.556727
R3  1.462108 -2.060141 -0.322417 -0.384054  1.133769 -0.598033
R4 -1.099891 -0.172428 -0.877858  0.042214  0.582815 -1.272319

In [14]:
df1.drop('C6',axis=1,inplace=True)

In [15]:
df1

          C1        C2        C3        C4        C5
R1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
R2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
R3  1.462108 -2.060141 -0.322417 -0.384054  1.133769
R4 -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [16]:
df1.drop('R4',axis=0) #axis = 0 for rows

          C1        C2        C3        C4        C5
R1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
R2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
R3  1.462108 -2.060141 -0.322417 -0.384054  1.133769

**Selecting Rows**

In [17]:
df1.loc['R2']

C1   -2.301539
C2    1.744812
C3   -0.761207
C4    0.319039
C5   -0.249370
Name: R2, dtype: float64

In [18]:
df1.iloc[2] #accessing rows based off of position instead of label

C1    1.462108
C2   -2.060141
C3   -0.322417
C4   -0.384054
C5    1.133769
Name: R3, dtype: float64

In [19]:
df1.loc['R2','C4'] #Selecting subset of rows and columns

0.31903909605709857

In [20]:
df1.loc[['R2','R3'],['C1','C5']]

          C1        C5
R2 -2.301539 -0.249370
R3  1.462108  1.133769

### Filtering data based on condition(Conditional Selection)

In [21]:
df1

          C1        C2        C3        C4        C5
R1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
R2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
R3  1.462108 -2.060141 -0.322417 -0.384054  1.133769
R4 -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [22]:
df1>0.3

       C1     C2     C3     C4     C5
R1   True  False  False  False   True
R2  False   True  False   True  False
R3   True  False  False  False   True
R4  False  False  False  False   True

In [23]:
df1[df1>0]

          C1        C2  C3        C4        C5
R1  1.624345       NaN NaN       NaN  0.865408
R2       NaN  1.744812 NaN  0.319039       NaN
R3  1.462108       NaN NaN       NaN  1.133769
R4       NaN       NaN NaN  0.042214  0.582815

In [24]:
df1['C1']>0.3

R1     True
R2    False
R3     True
R4    False
Name: C1, dtype: bool

In [25]:
df1[df1['C1']>0.3]

          C1        C2        C3        C4        C5
R1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
R3  1.462108 -2.060141 -0.322417 -0.384054  1.133769

In [26]:
df1[df1['C1']>0.3]['C3']

R1   -0.528172
R3   -0.322417
Name: C3, dtype: float64

In [27]:
df1[df1['C1']>0.3][['C3','C5']]

          C3        C5
R1 -0.528172  0.865408
R3 -0.322417  1.133769

For multiple conditions use logical operators like &,| etc.

In [28]:
df1[(df1['C1']>0.3) & (df1['C3'] > 1.2)]

Empty DataFrame
Columns: [C1, C2, C3, C4, C5]
Index: []

### More about Indexing 

Let's see how to reset the index or setting it to something else.

In [29]:
df1

          C1        C2        C3        C4        C5
R1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
R2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
R3  1.462108 -2.060141 -0.322417 -0.384054  1.133769
R4 -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [30]:
# Reset to default 0,1...n index
df1.reset_index()

  index        C1        C2        C3        C4        C5
0    R1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
1    R2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
2    R3  1.462108 -2.060141 -0.322417 -0.384054  1.133769
3    R4 -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [31]:
new_index = 'AB CD EF GH'.split()

In [32]:
df1['New'] = new_index

In [33]:
df1

          C1        C2        C3        C4        C5 New
R1  1.624345 -0.611756 -0.528172 -1.072969  0.865408  AB
R2 -2.301539  1.744812 -0.761207  0.319039 -0.249370  CD
R3  1.462108 -2.060141 -0.322417 -0.384054  1.133769  EF
R4 -1.099891 -0.172428 -0.877858  0.042214  0.582815  GH

In [34]:
df1.set_index('New')

           C1        C2        C3        C4        C5
New
AB   1.624345 -0.611756 -0.528172 -1.072969  0.865408
CD  -2.301539  1.744812 -0.761207  0.319039 -0.249370
EF   1.462108 -2.060141 -0.322417 -0.384054  1.133769
GH  -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [35]:
df1

          C1        C2        C3        C4        C5 New
R1  1.624345 -0.611756 -0.528172 -1.072969  0.865408  AB
R2 -2.301539  1.744812 -0.761207  0.319039 -0.249370  CD
R3  1.462108 -2.060141 -0.322417 -0.384054  1.133769  EF
R4 -1.099891 -0.172428 -0.877858  0.042214  0.582815  GH

In [36]:
df1.set_index('New',inplace=True)

In [37]:
df1

           C1        C2        C3        C4        C5
New
AB   1.624345 -0.611756 -0.528172 -1.072969  0.865408
CD  -2.301539  1.744812 -0.761207  0.319039 -0.249370
EF   1.462108 -2.060141 -0.322417 -0.384054  1.133769
GH  -1.099891 -0.172428 -0.877858  0.042214  0.582815